# Final Project Submission

Please fill out:
* Student name: Jaklyn Soler
* Student pace: Full Time
* Scheduled project review date/time: 
* Instructor name: Rafael Carassco
* Blog post URL:

# Background Information

I just received a call from Microsoft and they have decided to build a film studio to create movies. They want me to help them better understand the movie industry. I need to explore what type of films are currently doing the best at the box office. Then I will create actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

# First, let's load some data!

In [30]:
import patoolib
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [33]:
!ls

bom.movie_gross.csv         imdb.title.principals.csv4
bom.movie_gross.csv1        imdb.title.principals.csv5
bom.movie_gross.csv10       imdb.title.principals.csv6
bom.movie_gross.csv11       imdb.title.principals.csv7
bom.movie_gross.csv2        imdb.title.principals.csv8
bom.movie_gross.csv3        imdb.title.principals.csv9
bom.movie_gross.csv4        imdb.title.ratings.csv
bom.movie_gross.csv5        imdb.title.ratings.csv1
bom.movie_gross.csv6        imdb.title.ratings.csv10
bom.movie_gross.csv7        imdb.title.ratings.csv11
bom.movie_gross.csv8        imdb.title.ratings.csv2
bom.movie_gross.csv9        imdb.title.ratings.csv3
imdb.name.basics.csv        imdb.title.ratings.csv4
imdb.name.basics.csv1       imdb.title.ratings.csv5
imdb.name.basics.csv10      imdb.title.ratings.csv6
imdb.name.basics.csv11      imdb.title.ratings.csv7
imdb.name.basics.csv2       imdb.title.ratings.csv8
imdb.name.basics.csv3       imdb.title.ratings.csv9
imdb.name.basics.csv4       rt.movie_info.tsv
imdb.name.basics.csv5       rt.movie_info.tsv1
imdb.name.basics.csv6       rt.movie_info.tsv10
imdb.name.basics.csv7       rt.movie_info.tsv11
imdb.name.basics.csv8       rt.movie_info.tsv2
imdb.name.basics.csv9       rt.movie_info.tsv3
imdb.title.akas.csv         rt.movie_info.tsv4
imdb.title.akas.csv1        rt.movie_info.tsv5
imdb.title.akas.csv10       rt.movie_info.tsv6
imdb.title.akas.csv11       rt.movie_info.tsv7
imdb.title.akas.csv2        rt.movie_info.tsv8
imdb.title.akas.csv3        rt.movie_info.tsv9
imdb.title.akas.csv4        rt.reviews.tsv
imdb.title.akas.csv5        rt.reviews.tsv1
imdb.title.akas.csv6        rt.reviews.tsv10
imdb.title.akas.csv7        rt.reviews.tsv11
imdb.title.akas.csv8        rt.reviews.tsv2
imdb.title.akas.csv9        rt.reviews.tsv3
imdb.title.basics.csv       rt.reviews.tsv4
imdb.title.basics.csv1      rt.reviews.tsv5
imdb.title.basics.csv10     rt.reviews.tsv6
imdb.title.basics.csv11     rt.reviews.tsv7
imdb.title.basics.csv2      rt.reviews.tsv8
imdb.title.basics.csv3      rt.reviews.tsv9
imdb.title.basics.csv4      tmdb.movies.csv
imdb.title.basics.csv5      tmdb.movies.csv1
imdb.title.basics.csv6      tmdb.movies.csv10
imdb.title.basics.csv7      tmdb.movies.csv11
imdb.title.basics.csv8      tmdb.movies.csv2
imdb.title.basics.csv9      tmdb.movies.csv3
imdb.title.crew.csv         tmdb.movies.csv4
imdb.title.crew.csv1        tmdb.movies.csv5
imdb.title.crew.csv10       tmdb.movies.csv6
imdb.title.crew.csv11       tmdb.movies.csv7
imdb.title.crew.csv2        tmdb.movies.csv8
imdb.title.crew.csv3        tmdb.movies.csv9
imdb.title.crew.csv4        tn.movie_budgets.csv
imdb.title.crew.csv5        tn.movie_budgets.csv1
imdb.title.crew.csv6        tn.movie_budgets.csv10
imdb.title.crew.csv7        tn.movie_budgets.csv11
imdb.title.crew.csv8        tn.movie_budgets.csv2
imdb.title.crew.csv9        tn.movie_budgets.csv3
imdb.title.principals.csv   tn.movie_budgets.csv4
imdb.title.principals.csv1  tn.movie_budgets.csv5
imdb.title.principals.csv10 tn.movie_budgets.csv6
imdb.title.principals.csv11 tn.movie_budgets.csv7
imdb.title.principals.csv2  tn.movie_budgets.csv8
imdb.title.principals.csv3  tn.movie_budgets.csv9

In [4]:
#To Prohibit Truncating: 

pd.options.display.max_rows = 300

# Great! Now, let's take a peek at the data we have!

In [ ]:
#To change the order of columns, just arrange them how you want them: 
#df = df[['mean', 4,3,2,1]]

In [5]:
pd.options.display.max_rows = 100

In [51]:
movie_budgets = pd.read_csv('tn.movie_budgets.csv')
movie_budgets.head(2)
#Let's shape movie budgets and movie_gross to concatenate

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [52]:
movie_budgets.drop(columns=['id'], inplace = True)

In [53]:
movie_budgets.head(3)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"

In [ ]:
movie_budgets = movie_budgets[['movie', 'production_budget', 'domestic_gross', 'worldwide_gross', 'release_date']]

In [60]:
movie_budgets.head()

,movie,production_budget,domestic_gross,worldwide_gross,release_date
0,Avatar,"$425,000,000","$760,507,625","$2,776,345,279","Dec 18, 2009"
1,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875","May 20, 2011"
2,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350","Jun 7, 2019"
3,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963","May 1, 2015"
4,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747","Dec 15, 2017"

In [61]:
movie_budgets['release_date'] = pd.to_datetime(movie_budgets['release_date'],
                                            format = '%b %d, %Y')

In [63]:
movie_budgets['release_date'] = pd.to_datetime(movie_budgets['release_date']).dt.year

In [75]:
movie_budgets['production_budget'] = movie_budgets['production_budget'].str.replace(',', '')
movie_budgets['production_budget'] = movie_budgets['production_budget'].str.replace('$', '')
movie_budgets['domestic_gross'] = movie_budgets['domestic_gross'].str.replace(',', '')
movie_budgets['domestic_gross'] = movie_budgets['domestic_gross'].str.replace('$', '')
movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].str.replace(',', '')
movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].str.replace('$', '')
movie_budgets['production_budget'].astype(float)
movie_budgets['domestic_gross'].astype(float)
movie_budgets['worldwide_gross'].astype(float)

0       2.776345e+09
1       1.045664e+09
2       1.497624e+08
3       1.403014e+09
4       1.316722e+09
            ...
5777    0.000000e+00
5778    2.404950e+05
5779    1.338000e+03
5780    0.000000e+00
5781    1.810410e+05
Name: worldwide_gross, Length: 5782, dtype: float64

In [76]:
movie_budgets.head()

,movie,production_budget,domestic_gross,worldwide_gross,release_date
0,Avatar,425000000,760507625,2776345279,2009
1,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011
2,Dark Phoenix,350000000,42762350,149762350,2019
3,Avengers: Age of Ultron,330600000,459005868,1403013963,2015
4,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017

In [59]:
movie_budgets['release_date'].describe()

count             5782
unique            2418
top       Dec 31, 2014
freq                24
Name: release_date, dtype: object

In [69]:
movie_budgets['production_budget'].describe()

count            5782
unique            509
top       $20,000,000
freq              231
Name: production_budget, dtype: object

In [25]:
movie_gross = pd.read_csv('bom.movie_gross.csv')
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [66]:
movie_gross.drop(columns='studio', inplace = True)

In [77]:
movie_gross.head()

,title,domestic_gross,foreign_gross,year
0,Toy Story 3,415000000.0,652000000,2010
1,Alice in Wonderland (2010),334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300000,2010
3,Inception,292600000.0,535700000,2010
4,Shrek Forever After,238700000.0,513900000,2010

In [ ]:
movie_gross = movie_gross[['movie', 'production_budget', 'domestic_gross', 'worldwide_gross', 'release_date']]

In [73]:
movies_again = pd.read_csv('tmdb.movies.csv')
movies_again.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [9]:
movies_again.shape

(26517, 10)

In [5]:
more_crew = pd.read_csv('imdb.title.principals.csv')
more_crew.head()
USE T KEY

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [24]:
more_crew[more_crew['tconst'] == 'tt0369610']
USE T KEY

,tconst,ordering,nconst,category,job,characters
23225,tt0369610,10,nm0189777,producer,producer,NaN
23226,tt0369610,1,nm0695435,actor,NaN,"[""Owen""]"
23227,tt0369610,2,nm0397171,actress,NaN,"[""Claire""]"
23228,tt0369610,3,nm1339223,actor,NaN,"[""Gray""]"
23229,tt0369610,4,nm0339460,actress,NaN,"[""Karen""]"
23230,tt0369610,5,nm1119880,director,NaN,NaN
23231,tt0369610,6,nm0415425,writer,screenplay by,NaN
23232,tt0369610,7,nm0798646,writer,screenplay by,NaN
23233,tt0369610,8,nm2081046,writer,screenplay by,NaN
23234,tt0369610,9,nm0000341,writer,based on the characters created by,NaN

In [ ]:
tt0369610

In [6]:
more_crew.shape

(1028186, 6)

In [7]:
crew_df = pd.read_csv('imdb.title.crew.csv')
crew_df.head()
Use T KEY

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [8]:
crew_df.shape

(146144, 3)

In [43]:
title_info = pd.read_csv('imdb.title.basics.csv')
title_info.head()

#keeping original titles, not primary
#use as a key for other tables

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [10]:
title_info.shape

(146144, 6)

In [42]:
title_df = pd.read_csv('imdb.title.akas.csv')

#Only keep when original title = 1
# Use T key on this one.

In [85]:
title_df.shape

(331703, 8)

In [81]:
valid_title_df = title_df[title_df['is_original_title'] == 1]

In [86]:
valid_title_df['types'].value_counts()

original    44700
Name: types, dtype: int64

In [87]:
valid_title_df.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
38,tt0369610,45,Jurassic World,NaN,NaN,original,NaN,1.0
80,tt0401729,7,John Carter,NaN,NaN,original,NaN,1.0
83,tt10010134,1,Versailles Rediscovered - The Sun King's Vanis...,NaN,NaN,original,NaN,1.0
86,tt10027708,1,Miguelito - Canto a Borinquen,NaN,NaN,original,NaN,1.0
90,tt10050722,1,Thing I Don't Get,NaN,NaN,original,NaN,1.0

In [23]:
title_df['region'].value_counts()

US      51490
XWW     18467
RU      13817
DE      11634
FR      10990
ES       9007
GB       8942
CA       8871
PL       8691
IN       8435
BR       8167
IT       7983
GR       6311
JP       6308
HU       6258
TR       5052
AR       4729
PT       4629
SE       4444
MX       3869
FI       3851
BG       3728
RS       3696
RO       3534
IL       3000
AU       2774
UA       2563
LT       2490
CN       2448
DK       2125
NO       2091
KR       1918
NL       1905
HR       1903
CL       1817
CZ       1707
PE       1628
VN       1578
SI       1510
EE       1444
UY       1427
PH       1357
HK       1308
IR       1240
BE       1182
CH       1058
AT        956
IE        744
ID        689
CO        672
SK        650
XEU       630
ZA        615
TH        577
TW        552
MY        527
VE        486
LV        477
NZ        458
EG        377
BA        366
SG        362
BD        315
NG        278
GE        275
DO        271
AZ        266
IS        235
AL        205
PK        183
NP        178
PR        163
LB        162
KZ        148
MA        142
EC        137
CU        133
LK        133
LU        120
AM        119
BO        108
PA         94
CR         93
AE         92
MK         79
DZ         75
GT         65
TN         64
MN         63
BY         60
IQ         57
KE         55
KH         50
TT         49
UG         48
XAS        48
PS         48
PY         46
CY         46
AF         43
UZ         39
KG         36
QA         36
GH         35
SY         35
TZ         31
KW         31
JM         28
JO         27
HT         26
ET         26
BS         26
SV         26
XSA        26
MM         26
XKV        25
BF         22
CM         22
HN         21
CSXX       20
BH         19
MD         19
SA         18
MO         18
BT         18
ME         17
MT         17
MV         16
SN         16
NI         16
MZ         16
AO         15
LA         14
GU         14
RW         14
VI         11
BB         11
KP         10
ZW         10
TJ         10
MW         10
MC          9
GL          9
ML          9
CD          9
SL          9
GW          8
FJ          8
AG          8
CI          8
SM          8
LI          7
SD          7
YE          7
MG          6
GP          6
RE          6
CG          6
AN          5
MH          5
MU          5
SZ          5
BM          5
BZ          5
TL          5
NE          4
PG          4
LR          4
IM          4
XKO         4
BI          4
VU          4
BJ          4
SO          4
GA          4
OM          3
AD          3
BN          3
KY          3
SR          3
ER          3
AS          3
TD          3
AW          3
AQ          3
MR          3
FO          3
XYU         3
LC          2
ZM          2
GM          2
DM          2
CV          2
TG          2
XWG         2
PF          2
AI          1
CSHH        1
LY          1
LS          1
SB          1
BUMM        1
EH          1
VC          1
TO          1
NC          1
CF          1
SUHH        1
KN          1
MQ          1
XNA         1
WF          1
TM          1
Name: region, dtype: int64

In [13]:
film_employees = pd.read_csv('imdb.name.basics.csv')
film_employees.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [14]:
film_employees.shape

(606648, 6)

In [17]:
title_ratings = pd.read_csv('imdb.title.ratings.csv')
title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [18]:
title_ratings.shape

(73856, 3)